[
 {
  "level": "Bronze Sponsor",
  "activation": [
   "Your name, logo, and website featured on the THS Open website and in our tournament communications.",
   "No need to attend the event—we'll handle everything!"
  ],
  "contribution": [
   "$Your $250 donation goes directly to CAN (Canadian Autism Network), and you’ll receive a tax receipt.",
   "It’s an easy way to show your support for a great cause and make a real impact!"
  ]
 },
 {
  "level": "Silver Sponsor",
  "activation": [
   "Hole Sponsorship – your signage will be featured at a designated hole. You’re encouraged to bring snacks, drinks, or swag to create a fun, memorable experience for golfers!",
   "Your name, logo, and website featured on the THS Open website and in tournament communications.",
   "A great chance to connect with participants and show your community spirit."
  ],
  "contribution": [
   "Your $500 donation goes directly to CAN (Canadian Autism Network), and you’ll receive a tax receipt.",
   "It’s a meaningful way to support an important cause while being part of a great day!"
  ]
 },
 {
  "level": "Gold Sponsor",
  "activation": [
   "Cart Sponsor A - name and logo on every hole A cart.",
   "Cart Sponsor B - name and logo on every hole B cart.",
   "Prime Rib Dinner Sponsor – your name and logo displayed on every table during the post-round dinner.",
   "Scorecard Sponsor - your name and logo featured in the digital scorekeeping app during the round.",
   "Trophy Sponsor - your name and logo engraved on the trophy plate for the winning team.",
   "All options include your logo, name, and website featured on the THS Open website and in tournament communications. Want to try something unique? We're open to creative ideas too—let's make it memorable!"
  ],
  "contribution": [
   "Your $1,000 donation goes directly to CAN (Canadian Autism Network), and you’ll receive a tax receipt.",
   "It’s a powerful way to support a meaningful cause and connect with the community in a fun, visible way."
  ]
 },
 {
  "level": "Title Sponsor - The Hockey Shop",
  "activation": [
   "As the Title Sponsor, your name and logo will be featured prominently in all tournament communications and signage.",
   "The event will be presented as: THS Open – Presented by [Your Company Name]",
   "Maximum visibility and recognition throughout the entire tournament experience."
  ],
  "contribution": [
   "Your $5,000 donation goes directly to CAN (Canadian Autism Network), and you’ll receive a tax receipt.",
   "It’s the ultimate way to lead by example and show your commitment to a cause that matters."
  ]
 }
]